NictheJimenez/From_Scratch_DS3231_RTC_Module_and_STM32_cubeide_I2C_LCD-/drivers/Src/stm32l475xx_i2c_driver.c
/*
 *                                                                                stm32l475xx_i2c_drivers.c
 */

#include <stm32l475xx_i2c_driver.h>

// software to control the division factor of the AHB clock
uint16_t AHB_preScaler[8] = {2, 4, 8, 16, 64, 128, 256, 512};
// software to control the division factor of the APB1 clock
uint16_t APB1_preScaler[4] = {2, 4, 8, 16};
//0x20303e5d
/*
 * Generate Start Condition
 */
static void I2C_GenerateStartCondition(I2C_RegDef_t * pI2Cx);

static void I2C_ExecuteAddressPhase(I2C_RegDef_t * pI2Cx, uint8_t SlaveAddr);

static void I2C_ClearADDRFlag(I2C_RegDef_t * pI2Cx);

static void I2C_ClearSTOPCFFlag(I2C_RegDef_t * pI2Cx);

static void I2C_ClearNACKCFFlag(I2C_RegDef_t * pI2Cx);

static void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx);

static void I2C_AddressMode7bits(I2C_RegDef_t *pI2Cx);

static void  I2C_TransferDirWorRMasterM(I2C_RegDef_t *pI2Cx, uint8_t RorWTransfer);

static void I2C_NBytestobeTransferred(I2C_RegDef_t *pI2Cx,uint8_t Len);

static void I2C_NBytestoControl(I2C_RegDef_t *pI2Cx);

static void I2C_AutoendCondition(I2C_RegDef_t *pI2Cx, uint8_t AutoendEnorDi);

static void I2C_RestartCondition(I2C_RegDef_t *pI2Cx, uint8_t RestartdEnorDi);

/*
 * ADD10: 10-bit addressing mode (master mode)
0: The master operates in 7-bit addressing mode
 */
static void I2C_AddressMode7bits(I2C_RegDef_t *pI2Cx){
	pI2Cx ->CR2 &= ~(1 << I2C_CR2_ADD10);
}

/*
 * RD_WRN: Transfer direction (master mode)
0: Master requests a write transfer.
1: Master requests a read transfer
 */
static void  I2C_TransferDirWorRMasterM(I2C_RegDef_t *pI2Cx, uint8_t RorWTransfer){
	if(RorWTransfer == I2C_WRITE_TRANSFER_MM){  // Master requests a write transfer.   (master mode)
		pI2Cx -> CR2 &= ~(1 << I2C_CR2_RDWRN);
	}else if(RorWTransfer == I2C_READ_TRANSFER_MM){
		pI2Cx -> CR2 |= (1 << I2C_CR2_RDWRN);
	}
}

/*
 *  Start generation
This bit is set by software, and cleared by hardware after the Start followed by the address
sequence is sent, by an arbitration loss, by a timeout error detection, or when PE = 0. It can
also be cleared by software by writing ‘1’ to the ADDRCF bit in the I2C_ICR register.
0: No Start generation.
1: Restart/Start generation:
 */
static void I2C_GenerateStartCondition(I2C_RegDef_t * pI2Cx){
	pI2Cx -> CR2 &= ~(1 << I2C_CR2_STOP);
	pI2Cx ->CR2 &= ~(1 << I2C_CR2_START);
	pI2Cx ->CR2 |= (1 << I2C_CR2_START);
}

static void I2C_ExecuteAddressPhase(I2C_RegDef_t * pI2Cx, uint8_t SlaveAddr){
	pI2Cx -> CR2 &= ~( 0x7F << 1);
	//SlaveAddr = SlaveAddr >> 1;
	//SlaveAddr &= ~(1); // SlaveAddr is Slave Address + r/w bit = 0
	pI2Cx -> CR2 |= (SlaveAddr<<1 );
}

/*Number of bytes
*The number of bytes to be transmitted/received is programmed there. This field is don’t care
*in slave mode with SBC=0.
*Note: Changing these bits when the START bit is set is not allowed.
 */
static void I2C_NBytestobeTransferred(I2C_RegDef_t *pI2Cx,uint8_t Len){
	pI2Cx ->CR2 &= ~(0xFF << I2C_CR2_NBYTES);
	pI2Cx ->CR2 |= (Len << I2C_CR2_NBYTES);
}

static void I2C_ClearADDRFlag(I2C_RegDef_t * pI2Cx){
	uint32_t dummySet;

	dummySet = (1 << I2C_ICR_ADDRCF);
	pI2Cx -> ICR |= dummySet;
}

static void I2C_ClearSTOPCFFlag(I2C_RegDef_t * pI2Cx){
	uint32_t dummySet;

		dummySet = (1 << I2C_ICR_STOPCF);
		pI2Cx -> ICR |= dummySet;
}

static void I2C_ClearNACKCFFlag(I2C_RegDef_t * pI2Cx){
	uint32_t dummySet;

		dummySet = (1 << I2C_ICR_NACKCF);
		pI2Cx -> ICR |= dummySet;
}

static void I2C_AutoendCondition(I2C_RegDef_t *pI2Cx, uint8_t AutoendEnorDi){
	if(AutoendEnorDi == I2C_AUTOEND_DISABLE_MM){  // Master requests a write transfer.   (master mode)
		pI2Cx -> CR2 &= ~(1 << I2C_CR2_AUTOEND); //1: Automatic end mode: a STOP condition is automatically sent when NBYTES data are transferred.
	}else if(AutoendEnorDi == I2C_AUTOEND_ENABLE_MM){
			pI2Cx -> CR2 |= (1 << I2C_CR2_AUTOEND); //0: software end mode: TC flag is set when NBYTES data are transferred, stretching SCL low.
	}
}
static void I2C_RestartCondition(I2C_RegDef_t *pI2Cx, uint8_t RestartdEnorDi){
	if(AutoendEnorDi == I2C_AUTOEND_DISABLE_MM){  // Master requests a write transfer.   (master mode)
			pI2Cx -> CR2 &= ~(1 << I2C_CR2_AUTOEND); //1: Automatic end mode: a STOP condition is automatically sent when NBYTES data are transferred.
	}else if(AutoendEnorDi == I2C_AUTOEND_ENABLE_MM){
			pI2Cx -> CR2 |= (1 << I2C_CR2_AUTOEND); //0: software end mode: TC flag is set when NBYTES data are transferred, stretching SCL low.
	}
}

/*
 *  Stop generation (master mode)
The bit is set by software, cleared by hardware when a STOP condition is detected, or when
PE = 0.
In Master Mode:
0: No Stop generation.
1: Stop generation after current byte transfer.
 */
static void I2C_GenerateStopCondition(I2C_RegDef_t *pI2Cx){
	pI2Cx -> CR2 &= ~(1 << I2C_CR2_STOP);
	pI2Cx -> CR2 |= (1 << I2C_CR2_STOP);
}

/*
 *
 */
static void I2C_NBytestoControl(I2C_RegDef_t *pI2Cx){
	pI2Cx -> CR1 &= ~(1 << I2C_CR1_SBC);
	pI2Cx -> CR2 &= ~(1 << I2C_CR2_RELOAD);
	pI2Cx -> CR1 |= (1 << I2C_CR1_SBC);
	pI2Cx -> CR2 |= (1 << I2C_CR2_RELOAD);
}

/*
 * Clock configuration
 */
 uint32_t RCC_PLLOutClk(){
	 return;
 }
 /*
  * Clock configuration
  */
 uint32_t RCC_MSIOutClk(){
	 return;
 }
 /*
  * Clock configuration register (RCC_CFGR)
  */
uint32_t RCC_GetPCLK1Value(void){
	uint32_t pclk1, SystemClk;
	uint8_t clksrc, temp, ahbp, apbp1;

	clksrc = ((RCC ->CFGR >> 2) & 0x3);

	if(clksrc == RCC_CFGR_SWS_MSI){
		SystemClk = RCC_MSIOutClk();
	}else if(clksrc == RCC_CFGR_SWS_HSI){
		SystemClk = 16000000;
	}else if(clksrc == RCC_CFGR_SWS_HSE){
		SystemClk = 8000000;
	}else if(clksrc == RCC_CFGR_SWS_PLL){
		SystemClk = RCC_PLLOutClk();
	}

	//: AHB prescaler
	temp = ((RCC ->CFGR >> 4) & 0xf);

	if(temp < 8){
		ahbp = 1;
	}else{
		ahbp = AHB_preScaler[temp - 8];
	}

	//: APB1 prescaler
	temp = ((RCC ->CFGR >> 8) & 0x7);

	if(temp < 4){
		apbp1 = 1;
	}else{
		apbp1 = APB1_preScaler[temp - 4];
	}

	pclk1 = ((SystemClk / ahbp) / apbp1);

return pclk1;
}
void Timing_Settings(I2C_Handle_t *pI2CHandle){

	pI2CHandle ->pI2Cx ->TIMINGR &= ~(0xFF << I2C_TIMINGR_SCLL);
	pI2CHandle ->pI2Cx ->TIMINGR |= (0x5D << I2C_TIMINGR_SCLL);
   //pI2CHandle ->pI2Cx ->TIMINGR |= (0x13 << I2C_TIMINGR_SCLL);

	pI2CHandle ->pI2Cx ->TIMINGR &= ~(0xFF << I2C_TIMINGR_SCLH);
	pI2CHandle ->pI2Cx ->TIMINGR |= (0x3e << I2C_TIMINGR_SCLH);
	//pI2CHandle ->pI2Cx ->TIMINGR |= (0xF << I2C_TIMINGR_SCLH);

