NictheJimenez/From_Scratch_DS3231_RTC_Module_and_STM32_cubeide_I2C_LCD-/drivers/Src/stm32l475xx_i2c_driver.c
	pI2CHandle ->pI2Cx ->TIMINGR &= ~(0xF << I2C_TIMINGR_SDADEL);
	pI2CHandle ->pI2Cx ->TIMINGR |= (0x0 << I2C_TIMINGR_SDADEL);
	//pI2CHandle ->pI2Cx ->TIMINGR |= (0x2 << I2C_TIMINGR_SDADEL);

	pI2CHandle ->pI2Cx ->TIMINGR &= ~(0xF << I2C_TIMINGR_SCLDEL);
	pI2CHandle ->pI2Cx ->TIMINGR |= (0x3 << I2C_TIMINGR_SCLDEL);
	//pI2CHandle ->pI2Cx ->TIMINGR |= (0x4 << I2C_TIMINGR_SCLDEL);

	pI2CHandle ->pI2Cx ->TIMINGR &= ~(0xF << I2C_TIMINGR_PRESC);
	//pI2CHandle ->pI2Cx ->TIMINGR |= (3 << I2C_TIMINGR_PRESC);
	pI2CHandle ->pI2Cx ->TIMINGR |= (0x2 << I2C_TIMINGR_PRESC);
}
/*
 * Peripheral Clock Setup
 */
void I2C_PeriClockControl(I2C_RegDef_t* pI2Cx, uint8_t EnorDi){
	if(EnorDi ==ENABLE){
		if(pI2Cx == I2C1){
			I2C1_PCLK_EN();
		}else if(pI2Cx == I2C2){
			I2C2_PCLK_EN();
		}else if(pI2Cx == I2C3){
			I2C3_PCLK_EN();
		}
	}else
		if(pI2Cx == I2C1){
			I2C1_PCLK_DI();
		}else if(pI2Cx == I2C2){
			I2C2_PCLK_DI();
		}else if(pI2Cx == I2C3){
			I2C3_PCLK_DI();
		}
}
/*
 * Init
 */
void I2C_Init(I2C_Handle_t *pI2CHandle){
	uint32_t tempreg = 0;

	//enable the clock for the i2cx peripheral
	//	I2C_PeriClockControl(pI2CHandle ->pI2Cx, ENABLE);
	//ACK control bit
	tempreg = pI2CHandle ->I2C_Config.I2C_AckControl << I2C_CR2_NACK;//setting
	pI2CHandle -> pI2Cx -> CR2 &= ~(1 << I2C_CR2_NACK);//clearing
	pI2CHandle -> pI2Cx -> CR2 |= tempreg;

    //configure timings settings
	tempreg = 0;
	tempreg = RCC_GetPCLK1Value();
	Timing_Settings(pI2CHandle);

	//I2C slave mode
	//I2C slave initialization
	tempreg = pI2CHandle -> I2C_Config.I2C_DeviceAddress <<1;
	pI2CHandle -> pI2Cx -> OAR1 &= ~(1 << I2C_OAR1_OA1EN);
	pI2CHandle -> pI2Cx -> OAR1 |= tempreg;
	tempreg = 0;
	tempreg = (1 << I2C_OAR1_OA1EN);
	pI2CHandle -> pI2Cx -> OAR1 |= tempreg;

	//The general call address is enabled by setting the GCEN bit in the I2C_CR1 register.
	//
	pI2CHandle -> pI2Cx -> CR1 &= ~(1 << I2C_CR1_GCEN);
	pI2CHandle -> pI2Cx -> CR1 |= (1 << I2C_CR1_GCEN);

	//allow byte ACK control in slave reception mode. Slave byte control mode must be enabled by setting the SBC bit in the I2C_CR1 register
	//Note: The SBC bit must be configured when the I2C is disabled, or when the slave is not
	//addressed, or when ADDR=1
	pI2CHandle -> pI2Cx -> CR1 &= ~(1 << I2C_CR1_SBC);
	pI2CHandle -> pI2Cx -> CR1 |= (1 << I2C_CR1_SBC);

	//The user must then set the START bit in I2C_CR2 register. Changing all the above bits is
	//not allowed when START bit is set.

}
/*
 * De-Init
 */
void I2C_DeInit(I2C_RegDef_t* pI2Cx){
	//	I2C1-I2C2-I2C3 reset by APB1 peripheral reset register 1 (RCC_APB1RSTR1[1])
	if(pI2Cx == I2C1){
		I2C1_REG_RESET();
	}else if(pI2Cx == I2C2){
		I2C2_REG_RESET();
	}else if(pI2Cx == I2C3){
		I2C3_REG_RESET();
	}
}

/*
 * Data Send
 */
/*void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint8_t Len, uint8_t SlaveAddr,uint8_t RorWTransfer){

    //In order to initiate the communication, the user must program the following parameters for
	//the addressed slave in the I2C_CR2 register:

	//Addressing mode (7-bit or 10-bit): ADD10 => 0 <=: 10-bit addressing mode (master mode)
	//0: The master operates in 7-bit addressing mode,
	//1: The master operates in 10-bit addressing mode
	I2C_AddressMode7bits(pI2CHandle -> pI2Cx);

	//Slave address to be sent: SADD[9:0]
	//program the device address
	//: Slave address (master mode)
	//In 7-bit addressing mode (ADD10 = 0):
	//SADD[7:1] should be written with the 7-bit slave address to be sent. The bits SADD[9],
	//SADD[8] and SADD[0] are don't care.
	I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx, SlaveAddr);

	//Transfer direction: RD_WRN
     I2C_TransferDirWorRMasterM(pI2CHandle -> pI2Cx, RorWTransfer);

	//The number of bytes to be transferred: NBYTES[7:0]. If the number of bytes is equal to
	//or greater than 255 bytes, NBYTES[7:0] must initially be filled with 0xFF.
     I2C_NBytestobeTransferred(pI2CHandle -> pI2Cx, Len);
     //I2C_NBytestoControl(pI2CHandle -> pI2Cx);
     // Start generation with not Bus busy
     //while((I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_BUSY)));
    // Start generation
    //This bit is set by software, and cleared by hardware after the Start followed by the address
    // sequence is sent, by an arbitration loss, by a timeout error detection, or when PE = 0. It can
    // also be cleared by software by writing ‘1’ to the ADDRCF bit in the I2C_ICR register.
    // 0: No Start generation.
    // 1: Restart/Start generation:
     I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);


	//6. Send the data until Len becomes 0
	//while( (I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TCR)) ){
	//while(!(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXE)));  // wait till TXE is set
	while(Len > 0  ){
		while((I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXIS)));  // wait till TXE is set
		pI2CHandle -> pI2Cx -> TXDR = * pTxBuffer;
		pTxBuffer ++;
		Len --;
	}


	//while(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXE));
	while(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TC));
	//8. Generate Stop condition and master need not wait for the completion of Stop condition.
	// Note: generating STOP
	I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);
}*/
void I2C_MasterSendData(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint8_t Len, uint8_t SlaveAddr,uint8_t RorWTransfer, uint8_t AutoendEnorDi, uint8_t RestartdEnorDi){

    //In order to initiate the communication, the user must program the following parameters for
	//the addressed slave in the I2C_CR2 register:

	//Addressing mode (7-bit or 10-bit): ADD10 => 0 <=: 10-bit addressing mode (master mode)
	//0: The master operates in 7-bit addressing mode,
	//1: The master operates in 10-bit addressing mode
	I2C_AddressMode7bits(pI2CHandle -> pI2Cx);

	//Slave address to be sent: SADD[9:0]
	//program the device address
	//: Slave address (master mode)
	//In 7-bit addressing mode (ADD10 = 0):
	//SADD[7:1] should be written with the 7-bit slave address to be sent. The bits SADD[9],
	//SADD[8] and SADD[0] are don't care.
	I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx, SlaveAddr);

