NictheJimenez/From_Scratch_DS3231_RTC_Module_and_STM32_cubeide_I2C_LCD-/drivers/Src/stm32l475xx_i2c_driver.c
	//Transfer direction: RD_WRN
     I2C_TransferDirWorRMasterM(pI2CHandle -> pI2Cx, RorWTransfer);

	//The number of bytes to be transferred: NBYTES[7:0]. If the number of bytes is equal to
	//or greater than 255 bytes, NBYTES[7:0] must initially be filled with 0xFF.
     I2C_NBytestobeTransferred(pI2CHandle -> pI2Cx, Len);

     //In automatic end mode (AUTOEND=1), a STOP is automatically sent.
     //In software end mode (AUTOEND=0), the TC flag is
     I2C_AutoendCondition(pI2CHandle -> pI2Cx, AutoendEnorDi);

     I2C_RestartCondition(pI2CHandle -> pI2Cx, RestartdEnorDi);
     //I2C_NBytestoControl(pI2CHandle -> pI2Cx);
     // Start generation with not Bus busy
     //while((I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_BUSY)));
    // Start generation
    //This bit is set by software, and cleared by hardware after the Start followed by the address
    // sequence is sent, by an arbitration loss, by a timeout error detection, or when PE = 0. It can
    // also be cleared by software by writing ‘1’ to the ADDRCF bit in the I2C_ICR register.
    // 0: No Start generation.
    // 1: Restart/Start generation:
     I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);


	//6. Send the data until Len becomes 0
	//while( (I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TCR)) ){
	//while(!(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXE)));  // wait till TXE is set
	while(Len > 0 ){
		if(Len <= 255 ){
			while(!(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXIS)));  // wait till TXE is set
			pI2CHandle -> pI2Cx -> TXDR = * pTxBuffer;
			pTxBuffer ++;
			Len --;
		}else if(Len > 255){
			//If the total number of data bytes to be sent is greater than 255, reload mode
			//must be selected by setting the RELOAD bit in the I2C_CR2 register. In this case, when
			//NBYTES data have been transferred, the TCR flag is set and the SCL line is stretched low
			//until NBYTES[7:0] is written to a non-zero value.
		}
	}

	if((pI2CHandle -> pI2Cx -> CR2 & (1 << I2C_CR2_AUTOEND)) == I2C_AUTOEND_DISABLE_MM){
		if((pI2CHandle -> pI2Cx -> CR2 & (1 << I2C_CR2_RELOAD)) == I2C_RELOAD_DISABLE_MM){

			//while(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TXE));
			while(!(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TC)) );
			//8. Generate Stop condition and master need not wait for the completion of Stop condition.
			// Note: generating STOP
			I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);
		}
	}
}
/*
 *Data receive
*/
void I2C_MasterReceiveData(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint8_t Len, uint8_t SlaveAddr,uint8_t RorWTransfer){

	//Addressing mode (7-bit or 10-bit): ADD10 => 0 <=: 10-bit addressing mode (master mode)
	//0: The master operates in 7-bit addressing mode,
	//1: The master operates in 10-bit addressing mode
	I2C_AddressMode7bits(pI2CHandle -> pI2Cx);

	//Slave address to be sent: SADD[9:0]
	//program the device address
	//: Slave address (master mode)
	//In 7-bit addressing mode (ADD10 = 0):
	//SADD[7:1] should be written with the 7-bit slave address to be sent. The bits SADD[9],
	//SADD[8] and SADD[0] are don't care.
	I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx, SlaveAddr);

	//Transfer direction: RD_WRN
     I2C_TransferDirWorRMasterM(pI2CHandle -> pI2Cx, RorWTransfer);

     //The number of bytes to be transferred: NBYTES[7:0]. If the number of bytes is equal to
     //or greater than 255 bytes, NBYTES[7:0] must initially be filled with 0xFF.
     I2C_NBytestobeTransferred(pI2CHandle -> pI2Cx, Len);

     // Start generation
     //This bit is set by software, and cleared by hardware after the Start followed by the address
     // sequence is sent, by an arbitration loss, by a timeout error detection, or when PE = 0. It can
     // also be cleared by software by writing ‘1’ to the ADDRCF bit in the I2C_ICR register.
     // 0: No Start generation.
     // 1: Restart/Start generation:
     I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);
		//read the data until Len becomes zero
		for(uint32_t i= 0;i <= Len-1; i ++){
			//wait until RXNE becomes 1
    		while(!(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_RXNE)));  // wait till RXNE is set

    		//read the data from data register in the buffer
    		*pRxBuffer = pI2CHandle -> pI2Cx -> RXDR;

			if(i == Len -1){
				//I2C_ISR.TC = 1?
				while(!(I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_TC)));  // wait till TC is set
				//generate STOP condition
	    		I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);
			}
			//increment the buffer address
			pRxBuffer++;
		}

}
/*
 * I2C_MasterSendDataIT
 */
uint8_t I2C_MasterSendDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pTxBuffer, uint8_t Len, uint8_t SlaveAddr,uint8_t RorWTransfer, uint8_t Sr){

	uint8_t busystate = pI2CHandle -> TxRxState;

	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX)){
		pI2CHandle->pTxBuffer = pTxBuffer;
		pI2CHandle->TxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_TX;
		pI2CHandle->DevAddr = SlaveAddr;
		pI2CHandle->Sr = Sr;

		//Addressing mode (7-bit or 10-bit): ADD10 => 0 <=: 10-bit addressing mode (master mode)
			//0: The master operates in 7-bit addressing mode,
			//1: The master operates in 10-bit addressing mode
			I2C_AddressMode7bits(pI2CHandle -> pI2Cx);

			//Slave address to be sent: SADD[9:0]
			//program the device address
			//: Slave address (master mode)
			//In 7-bit addressing mode (ADD10 = 0):
			//SADD[7:1] should be written with the 7-bit slave address to be sent. The bits SADD[9],
			//SADD[8] and SADD[0] are don't care.
			I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx, SlaveAddr);

			//Transfer direction: RD_WRN
		     I2C_TransferDirWorRMasterM(pI2CHandle -> pI2Cx, RorWTransfer);

			//The number of bytes to be transferred: NBYTES[7:0]. If the number of bytes is equal to
			//or greater than 255 bytes, NBYTES[7:0] must initially be filled with 0xFF.
		     I2C_NBytestobeTransferred(pI2CHandle -> pI2Cx, Len);
		     //I2C_NBytestoControl(pI2CHandle -> pI2Cx);
		     // Start generation with not Bus busy
		     //while((I2C_GetFlagStatus(pI2CHandle -> pI2Cx, I2C_FLAG_BUSY)));
		    // Start generation
		    //This bit is set by software, and cleared by hardware after the Start followed by the address
		    // sequence is sent, by an arbitration loss, by a timeout error detection, or when PE = 0. It can
		    // also be cleared by software by writing ‘1’ to the ADDRCF bit in the I2C_ICR register.
		    // 0: No Start generation.
		    // 1: Restart/Start generation:
		     I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);


		//I2C Interrupt requests Enable control bit

		//I2C_EV

