NictheJimenez/From_Scratch_DS3231_RTC_Module_and_STM32_cubeide_I2C_LCD-/drivers/Src/stm32l475xx_i2c_driver.c
		/* Address matched ADDR*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_ADDRIE);
		/*Receive buffer not empty RXNE*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_RXIE);
		/*Transmit buffer interrupt status TXIS*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_TXIE);
		/*Stop detection interrupt flag STOPF*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_STOPIE);
		/*Transfer complete reload TCR, Transfer complete TC*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_TCIE);
		/* NACK reception NACKF*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_NACKIE);

		//I2C_ER

		/* Enable: Bus error  BERR, Arbitration loss ARLO, Overrun/Underrun OVR, PEC error PECERR, Timeout/tLOW error TIMEOUT, SMBus alert ALERT*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_ERRIE);
	}

	return busystate;
}
uint8_t I2C_MasterReceiveDataIT(I2C_Handle_t *pI2CHandle, uint8_t *pRxBuffer, uint8_t Len, uint8_t SlaveAddr,uint8_t RorWTransfer, uint8_t Sr){
	uint8_t busystate = pI2CHandle -> TxRxState;

	if( (busystate != I2C_BUSY_IN_TX) && (busystate != I2C_BUSY_IN_RX)){
		pI2CHandle->pTxBuffer = pRxBuffer;
		pI2CHandle->RxLen = Len;
		pI2CHandle->TxRxState = I2C_BUSY_IN_RX;
		pI2CHandle->DevAddr = SlaveAddr;
		pI2CHandle->Sr = Sr;

		//Implement code to Generate START Condition
		I2C_GenerateStartCondition(pI2CHandle ->pI2Cx);

		//I2C Interrupt requests Enable control bit

		//I2C_EV

		/* Address matched ADDR*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_ADDRIE);
		/*Receive buffer not empty RXNE*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_RXIE);
		/*Transmit buffer interrupt status TXIS*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_TXIE);
		/*Stop detection interrupt flag STOPF*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_STOPIE);
		/*Transfer complete reload TCR, Transfer complete TC*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_TCIE);
		/* NACK reception NACKF*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_NACKIE);

		//I2C_ER

		/* Enable: Bus error  BERR, Arbitration loss ARLO, Overrun/Underrun OVR, PEC error PECERR, Timeout/tLOW error TIMEOUT, SMBus alert ALERT*/
		pI2CHandle -> pI2Cx -> CR2 |= (1 << I2C_CR1_ERRIE);
	}

	return busystate;
}
/*
 * IRQ Configuration and ISR handling
 */
void I2C_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi){
	if(EnorDi == ENABLE){
			if(IRQNumber <= 31){
				        // program ISER0 register
				*NVIC_ISER0 |= (1 << IRQNumber);
			}else if(IRQNumber > 31 && IRQNumber < 64){
				        // program ISER1 register
				*NVIC_ISER1 |= (1 << IRQNumber % 32);
			}else if(IRQNumber >= 64 && IRQNumber < 96){
				       // program ISER2 register
				*NVIC_ISER2 |= (1 << IRQNumber % 64);
			}
		}else{
			if(IRQNumber <= 31){
				        // program ICER0 register
				*NVIC_ICER0 &= ~(1 << IRQNumber);
			}else if(IRQNumber > 31 && IRQNumber < 64){
				        // program ICER1 register
				*NVIC_ICER1 &= ~(1 << IRQNumber % 32);
			}else if(IRQNumber >= 64 && IRQNumber < 96){
				        // program ICER2 register
				*NVIC_ICER2 &= ~(1 << IRQNumber % 64);
			}
		}
}
void I2C_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority){
	//1. First lets find out the IPR register
	uint8_t IPRx = IRQNumber / 4;
	uint8_t IPRx_Section = IRQNumber % 4;
	uint8_t Shift_Amount = (8 * IPRx_Section) + (8 - NO_PR_BITS_IMPLEMENTED);
	*(NVIC_PR_BASEADDR + IPRx) |= (IRQPriority << Shift_Amount);
}
/*
 * other Peripheral Control APIs
 */
void I2C_PeripheralControl(I2C_RegDef_t* pI2Cx,uint8_t EnorDi){
	if(EnorDi == ENABLE){
		pI2Cx -> CR1 |= (1 << I2C_CR1_PE);
	}else{
		pI2Cx -> CR1 &= ~(1 << I2C_CR1_PE);
	}
}

/*
 *
 */
uint8_t I2C_GetFlagStatus(I2C_RegDef_t* pI2Cx, uint32_t FlagName){
	if(pI2Cx ->ISR & FlagName){
		return FLAG_SET;
	}
	return FLAG_RESET;
}
 /*
  * I2C_ManageAcking
  */
void I2C_ManageAcking(I2C_RegDef_t* pI2Cx,uint8_t EnorDi){
	if(EnorDi == I2C_ACK_ENABLE){
		//enable the ack
		pI2Cx -> CR2 &= ~(1 << I2C_CR2_NACK);
	}else{
		//disable the acking
		pI2Cx -> CR2 |= (1 << I2C_CR2_NACK);
	}
}
void I2C_SlaveSendData(I2C_Handle_t *pI2CHandle,uint8_t data){
	uint8_t temp = 0, tempcode = 0,tempdir = 0;
	//ADDR
	temp = pI2CHandle -> pI2Cx ->ISR  & (1 << I2C_ISR_ADDR);
	while(!temp);
	temp = 0;
		//Read ADDCODE and DIR in I2C_ISR
		//Set I2C_ICR.ADDRCF
		//EV1: ADDR ISR: check ADDCODE and DIR, set TXE, set ADDRCF
		tempcode = pI2CHandle -> pI2Cx ->ISR & (1 << I2C_ISR_ADDCODE);
		tempdir = pI2CHandle -> pI2Cx ->ISR  & (1 << I2C_ISR_DIR);
		temp = (uint8_t) pI2CHandle ->I2C_Config.I2C_DeviceAddress<< 1;
		//note: no entiendo el texto dir == T/R check
		if((tempcode == temp) && (tempdir ==  I2C_WRITE_TRANSFER_SM)){
            //Set I2C_ICR.ADDRCF
			pI2CHandle -> pI2Cx ->ICR |= (1 << I2C_ICR_ADDRCF);
			 // wait till RXNE is set
			while(!(I2C_GetFlagStatus( pI2CHandle -> pI2Cx, I2C_FLAG_TXIS)));
		    		//write the data from data register in the buffer
			 pI2CHandle -> pI2Cx ->TXDR = data;

		}
}

void I2C_SlaveReceiveData(I2C_Handle_t* pI2Cx, uint8_t *pRxBuffer){
	uint8_t temp = 0, tempcode = 0,tempdir = 0;
	//ADDR
	temp = pI2Cx ->pI2Cx ->ISR  & (1 << I2C_ISR_ADDR);
	while(!temp);
	temp = 0;
		//Read ADDCODE and DIR in I2C_ISR
		//Set I2C_ICR.ADDRCF
		//EV1: ADDR ISR: check ADDCODE and DIR, set TXE, set ADDRCF
		tempcode = pI2Cx ->pI2Cx ->ISR & (1 << I2C_ISR_ADDCODE);
		tempdir = pI2Cx ->pI2Cx ->ISR  & (1 << I2C_ISR_DIR);
		temp = (uint8_t) pI2Cx ->I2C_Config.I2C_DeviceAddress << 1;
		//note: no entiendo el texto dir == T/R check
		if((tempcode == temp) && (tempdir ==  I2C_READ_TRANSFER_SM)){
            //Set I2C_ICR.ADDRCF
			pI2Cx ->pI2Cx -> ICR |= (1 << I2C_ICR_ADDRCF);
			 // wait till RXNE is set
			while(!(I2C_GetFlagStatus( pI2Cx ->pI2Cx, I2C_FLAG_RXNE)));
		    		//read the data from data register in the buffer
		    		*pRxBuffer =  (uint8_t) pI2Cx ->pI2Cx-> RXDR;
		}
}

void I2C_EV_IRQHandling(I2C_Handle_t *pI2CHandle){
	//Interrupt handling for both master and slave mode of a device
	uint8_t tempRXIE, tempTXIS, tempSTOPF, tempTCR, tempADDR, tempNACKF, tempFlag;

	tempRXIE = pI2CHandle  -> pI2Cx -> CR1 & (1 << I2C_CR1_RXIE);
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_RXNE);

	//1. handle for interrupt generated by RXNE event
	if(tempRXIE && tempFlag){

	// RXNE flag is set
		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX){
			I2C_ExecuteAddressPhase(pI2CHandle -> pI2Cx, pI2CHandle -> DevAddr);
		}else if(pI2CHandle -> TxRxState == I2C_BUSY_IN_RX){

