NictheJimenez/From_Scratch_DS3231_RTC_Module_and_STM32_cubeide_I2C_LCD-/drivers/Src/stm32l475xx_i2c_driver.c
		}
	}

	tempTXIS = pI2CHandle  -> pI2Cx -> CR1 & (1 << I2C_CR1_TXIE);
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_TXIS);

	//1. handle for interrupt generated by RXNE event
	if(tempTXIS && tempFlag){
		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX){
			if(pI2CHandle ->TxLen > 0){
				// TXNE flag is set
				pI2CHandle -> pI2Cx -> TXDR = * pI2CHandle ->pTxBuffer;
				pI2CHandle ->pTxBuffer++;
				pI2CHandle ->TxLen--;
			}
		}
	}

	//1. handle for interrupt generated by TXIS event
	if(tempRXIE && tempFlag){

	// TXIS flag is set
		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX){
			if(pI2CHandle -> TxLen > 0){
				//load the data in to DR
				pI2CHandle -> pI2Cx -> TXDR = * (pI2CHandle -> pTxBuffer);
				//decrement the TxLen
				pI2CHandle -> TxLen --;
				//increment the buffer address
				pI2CHandle -> pTxBuffer++;
			}
		}
	}

	// STOPF flag is set
	tempSTOPF = pI2CHandle  -> pI2Cx -> CR1 & (1 << I2C_CR1_STOPIE);
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_STOPF);
	//1. handle for interrupt generated by STOPF event
	if(tempSTOPF && tempFlag){
		// STOPF flag is set
	}

	// TCR/TC flag is set
	tempTCR = pI2CHandle  -> pI2Cx -> CR1 & (1 << I2C_CR1_TCIE);
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_TCR);

	//1. handle for interrupt generated by TCR event
	if(tempTCR && tempFlag){
		// TCR flag is set
		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX){
			//if(pI2CHandle -> TxLen > 255){
					if(((pI2CHandle -> pI2Cx -> CR2 & (1 << I2C_CR2_AUTOEND)) == DISABLE) && (pI2CHandle -> pI2Cx -> CR2 & (1 << I2C_CR2_RELOAD) == ENABLE)){
							// In this mode, software action is expected once the number of bytes programmed in the NBYTES[7:0] bit field is transferred; the TC flag is set and an interrupt is generated if the TCIE bit is set
							I2C_GenerateStartCondition(pI2CHandle -> pI2Cx);

					}
			//}
		}
	}

	// TCR/TC flag is set
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_TC);
	//1. handle for interrupt generated by TC event
	if(tempTCR && tempFlag){
		//check for device mode

		if(pI2CHandle -> TxRxState == I2C_BUSY_IN_TX){
			//if(pI2CHandle -> TxLen == 0){
			// TCR flag is set
				if((pI2CHandle -> pI2Cx -> CR2 & (1 << I2C_CR2_AUTOEND) == ENABLE) && (pI2CHandle -> pI2Cx -> CR2 & (1 << I2C_CR2_RELOAD) == DISABLE)){
					// In this mode, the master automatically sends a STOP condition once the number of bytes programmed in the NBYTES[7:0] bit field is transferred
					I2C_GenerateStopCondition(pI2CHandle -> pI2Cx);
					//reset all the member elements of the handle structure
					//I2C_CloseSendData();
					//notify the application about transmission complete
					I2C_ApplicationEventCallback(pI2CHandle, I2C_EV_TX_CMPLT);
				}
			//}

		}
	}

	//ADDR flag is set
	tempADDR = pI2CHandle  -> pI2Cx -> CR1 & (1 << I2C_CR1_ADDRIE);
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_ADDR);

	//1. handle for interrupt generated by ADDR event
	if(tempADDR && tempFlag){
	// ADDR flag is set
		I2C_ClearADDRFlag(pI2CHandle -> pI2Cx);
	}

	//NACKF flag is set
	tempNACKF = pI2CHandle  -> pI2Cx -> CR1 & (1 << I2C_CR1_NACKIE);
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_NACKF);

	//1. handle for interrupt generated by NACKF event
	if(tempNACKF && tempFlag){
		// NACKF flag is set
	}


}
void I2C_ER_IRQHandling(I2C_Handle_t *pI2CHandle){
	uint8_t tempFlag, tempERRIE;

	//BERR flag is set
	tempERRIE = pI2CHandle  -> pI2Cx -> CR1 & (1 << I2C_CR1_ERRIE);
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_BERR);

	//1. handle for interrupt generated by Error
	if(tempERRIE && tempFlag){
	// BERR flag is set

	}

	// ARLO flag is set
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_ARLO);

	//1. handle for interrupt generated by Error
	if(tempERRIE && tempFlag){
	// ARLO flag is set

	}

	// OVR flag is set
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_OVR);
	if(tempERRIE && tempFlag){
	// OVR flag is set

	}

	// PECERR flag is set
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_PECERR);
	if(tempERRIE && tempFlag){
	// PECERR flag is set

	}

	// TIMEOUT flag is set
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_TIMEOUT);
	if(tempERRIE && tempFlag){
	// TIMEOUT flag is set

	}

	// ALERT flag is set
	tempFlag = pI2CHandle -> pI2Cx -> ISR & (1 << I2C_ISR_ALERT);
	if(tempERRIE && tempFlag){
	// ALERT flag is set

	}
}
